Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Inside the |layout| specifies coordinate system for subsequent location data (|origin|, |grid-origin|).
ru_ru: Внутри |layout| определяется система координат для последующих данных о местоположении (|origin|, |grid-origin|).

source: Installation.
ru_ru: Инсталляция.

source: Instructions on how to do this are in the { Appendix}.
ru_ru: Инструкции о том, как это сделать приведены в { Приложении}.

source: Introduction.
ru_ru: Введение.

source: It consists of one or more concatenated records.
ru_ru: Они состоят из одной или нескольких\break конкатенированных записей.

source: It contains preformatted cave name, north arrow, scale bar, explo/topo/carto teams, comment, copyrights and legend.
ru_ru: Он содержит предварительно отформатированное имя пещеры, стрелку на север, шкалу масштаба, команды исследователей, съемщиков и авторов\break карты, комментарии, авторские права и легенду.

source: It displays only the position, not the actual shape, of drawn point or line symbols.
ru_ru: Он отображает только позицию, а не фактическую форму, нарисованных точек или линий.

source: It does nothing if any of the specified fonts is not present.
ru_ru: Ничего не происходит, если какой-либо из указанных шрифтов отсутствует.

source: It gives also explanation of |color|, |transparency|, |symbol-hide| and |symbol-show| options of the |layout| command.
ru_ru: Также объясняются опции |color|, |transparent|,\break |symbol-hide| и |symbol-show| команды |layout|.

source: It helps a lot with creating input data files.
ru_ru: Он помогает в создании файлов входных данных.

source: It indicates where to put a direction arrow on the section line.
ru_ru: Он указывает, куда следует поместить стрелку направления на линию сечения.

source: It installs all the required stuff and creates shortcuts to XTherion and Therion Book.
ru_ru: Устанавливаются все необходимые материалы и создаются ярлыки для XTherion'а и Therion Book.

source: It is a text file starting with tables declaration (where `?' stands in the following listing for a maximal value required by the column data)
ru_ru: Это текстовый файл, начинающийся с объявления таблиц (в ниже расположенном коде '?' обозначает максимальное значение, требуемое данными в колонке)

source: It is also possible to add symbols permanently by compiling them into Therion executable (see the { Appendix} for instructions how to do this).
ru_ru: Также можно добавлять символы для постоянного использования,\break компилируя их в исполняемый файл Therion (смотрите { Приложение} для\break инструкций, как это сделать).

source: It is also possible to type (some small snippets of) code directly in configuration file using the multi-line syntax.
ru_ru: Также можно ввести некоторые небольшие фрагменты кода непосредственно в файле конфигурации, используя многострочный синтаксис.

source: It is automatically used if the cave is located in space using any of supported geodetic coordinate systems and no declination is specified by user.
ru_ru: Она автоматически используется, если пещера находится в пространстве с использованием любой из\break поддерживаемых геодезических систем координат, и никакое\break склонение не определяется пользователем.

source: It is fully customizable (see the chapter { Changing layout} for details).
ru_ru: Он полностью настраивается (подробнее смотрите главу {Изменение макета}).

source: It is ignored when used with local coordinate system.
ru_ru: Он\break игнорируется при использовании с локальной системой координат.

source: It is not necessary for Therion itself---you may edit input files in your favourite text editor and run Therion from the command line.
ru_ru: Его не обязательно использовать для Therion'а -- вы можете редактировать входные файлы в своем любимом текстовом редакторе и запускать\break Therion из командной строки.

source: It is not possible to specify more coordinate systems for different outputs (the last occurence of |cs| is used for all output files).
ru_ru: Невозможно указать несколько систем координат для разных выходных данных\break (последнее указание |cs| используется для всех выходных файлов).

source: It is only required for XTherion.
ru_ru: Это требуется только для XTherion'а.

source: It is possible to change the order by selecting a line and pressing { Move down}, { Move up} or { Move to} buttons in the { File commands} menu.
ru_ru: Можно изменить порядок, выбрав строку и нажав кнопки { Вниз}, { Вверх} или { Переместить} в меню { Команды в файле}.

source: It is possible to display it in two ways: as a scanned topographical map (both in 2D map and 3D modelYou need to enter elevation data in order to display the topographical map in 3D model.
ru_ru: Ее можно отобразить двумя\break способами: в качестве отсканированной топографической карты (как в\break 2D-карте, так и в 3D-модели Вам нужно ввести данные о высоте, чтобы отобразить топографическую карту в\break 3D-модели.

source: It is possible to display the whole map framed by setting the || dimen register to positive value, e.g. |0.5mm|.
ru_ru: Можно отобразить всю карту, обрамленную установкой регистра\break || в положительное значение, например |0.5mm|.

source: It is possible to write a better one, which would be more user friendly, more WYSIWYG, faster, more robust and easier to use.
ru_ru: Можно написать лучшую, более удобную для пользователя, более\break WYSIWYG-ориентированную, быструю, более надежную и удобную\breakв использовании.

source: It is read like any other therion file (i.e. one command per line; empty lines or lines starting with `|#|' are ignored; lines ended with a backslash continue on the next line.) A list of currently supported commands follow.
ru_ru: Он обрабатывается как любой другой файл (т.е. одна команда на строку, пустые строки или строки, начинающиеся с `|#|',\break игнорируются; строки, заканчивающиеся на обратную косую черту,\break продолжаются в следующей строке.) Ниже список поддерживаемых в\break данный момент команд.

source: It is useful for absolute placing of imported sketches where no survey stations are specified.If there are some survey stations in the scrap, the |cs| specification is ignored.] * |stations <list of station names>| = stations you want to plot to the scrap, but which are not used for scrap transformation.
ru_ru: Это полезно для абсолютного размещения импортированных эскизов, где не указана ни одна станция съемкиЕсли в скрапе есть несколько станций съемки, |cs| игнорируется.]. * |stations <список имен станций> | = станции, которые вы хотите\break использовать в скрапе, но которые не используются для его\break трансформации.

source: It may be an area definition or whatever you want, such as a comment beginning with a `||' character.] command, the contents of which (entered in the { Text editor} menu of the Map editor) is usual |area ... endarea| multi-line command (see the chapter { Data format}.)
ru_ru: Это может быть определение области или что угодно, например комментарий, начинающийся с символа `||'.], содержимое\break которого (введенное в меню { Редактор} в редакторе карты) обычно\break многострочная команда |area ... endarea| (смотрите раздел { Формат данных}.)

source: It may be customized to user's data order by pressing a { Scan data format} button when the cursor is below the data order specification (`data' option in the `centreline' command).
ru_ru: Она может быть настроена на ввод данных пользователя, нажав кнопку { Определить формат данных}, когда курсор находится под спецификацией данных (опция `дата' в команде `centreline').

source: It may contain following formatting keywords:For SVG output, only |<br>|, |<thsp>|, |<it>|, |<bf>|, |<rm>| and |<lang:XX>| keywords are taken into account; all others are silently ignored.]
ru_ru: Он может содержать следующие зарезервированные слова для форматированияДля вывода SVG учитываются только зарезервированные слова |<br>|, |<thsp>|, |<it>|, |<bf>|, |<rm>| и |<lang:XX>|; все остальные игнорируются.]:

source: It may look quite complicated, but this approach has a lot of advantages:
ru_ru: Это может выглядеть довольно сложно, но этот подход имеет много\break преимуществ:

source: It needs to be compiled and installed according to instructions in the { Appendix}.
ru_ru: Его необходимо\break скомпилировать и установить в соответствии с инструкциями в { Приложении}.

source: It processes input files, which are---including 2D maps---in text format, and creates files with 2D maps or 3D model as the output.
ru_ru: Он обрабатывает входные файлы в текстовом формате, в том числе 2D-карты, и создает файлы с\break 2D-картами или 3D-моделью в качестве вывода.

source: It reads the input files, interprets them, finds closed loops and distributes errors.
ru_ru: Он считывает входные файлы, интерпретирует их, находит замкнутые кольца и раскидывает ошибки.\break

source: It runs on Unix, Linux, MacOS X and Win32 operating systems.
ru_ru: Therion работает в операционных системах Unix, Linux, MacOS X и Win32.

source: It should be the very first command in the file.
ru_ru: Это должна быть самая первая команда в файле.

source: It should be used for shots, that were not surveyed properly and need to be resurveyed.
ru_ru: Он должен использоваться для замеров, которые не были сняты должным образом и нуждаются в пересъемке.

source: It should contain one or more || invocations.
ru_ru: Он должен\break содержать один или несколько || вызовов.

source: It starts in the grid-origin and fills the grid in rows (in the row from W to E; rows from S to N).
ru_ru: Начинается с начала сетки и заполняет сетку строками (в строке от З до В, строки от Ю до С).

source: It supports e.g. high-resolution rendering to file and stereo view using 3D-glasses.
ru_ru: Он поддерживает, например, рендеринг с высоким разрешением и\break стерео-просмотр с помощью 3D-очков.

source: It switches on/off the border line of the slope.
ru_ru: Он включает/выключает границу линии наклона.

source: It was always hard to add new surveys without adapting the old ones to the newly calculated positions of survey stations in the whole cave.
ru_ru: Всегда было трудно добавить новые исследования без адаптации старых к новым рассчитанным позициям станций во всей пещере.

source: It will print only warning and error messages to STDERR.
ru_ru: Он будет печатать только\break предупреждения и сообщения об ошибках в STDERR.

source: It's a distribution of GNU utilities with GNU make and GCC.
ru_ru: Эти дистрибутивы содержат GNU make и GCC.

source: It's a good idea to place a scrap join in the passage which is as simple as possible, otherwise you have to specify join for each pair of objects which should be joined.
ru_ru: Лучше всего размещать соединения скрапов в ходе, которое будет как можно более простым, иначе вам нужно будет указать соединение для каждой пары объектов, которые должны быть соединены

source: It's almost always a { bad} idea to try to fit each scrap to corresponding |*.th| file with centreline from one survey trip.
ru_ru: Попытка подобрать скрап к соответствующему |*.th| файлу с ниткой хода одной съемки -- это почти всегда {плохая} идея.

source: It's described in
ru_ru: Это описано в:

source: It's easy to add new encodings for 2D map output.
ru_ru: Легко добавить новые кодировки для вывода 2D-карты

source: It's handy to start with an empty template file as shown below, where dots will be replaced with appropriate texts.
ru_ru: Удобно начинать с пустого файла шаблона, как показано ниже, где точки будут заменены соответствующим текстом.

source: It's important to remember, that you're actually creating a text file which should conform to the syntax described in the chapter { Data format}.
ru_ru: Важно помнить, что вы на самом деле создаете текстовый файл, который должен соответствовать синтаксису,\break описанному в главе { Формат данных}.

source: It's necessary to specify |l-size| in at least one point.
ru_ru: Необходимо указать\break |l-size| по меньшей мере для одной точки.

source: It's only a nickname for a block of an arbitrary text in XTherion.
ru_ru: Это всего лишь псевдоним для блока произвольного текста в XTherion'е.

source: It's possible to include survey in the map---this will display centreline in the map.
ru_ru: На карте можно включить съемку, тогда на карте будет отображаться нитка хода.

source: It's possible to open an existing file without loading of background images using { Open XP} menu.
ru_ru: Можно открыть существующий файл без загрузки фоновых\break изображений с помощью меню { Открыть (без картинок)}

source: It's useful when the survey has the same name as the file which contains it.
ru_ru: Это полезно, если survey имеет то же имя, что и файл, который его содержит

source: Its attributes can be adjusted in the { Point control} menu.
ru_ru: Ее атрибуты можно настроить в меню { Точка}.

source: Its purpose is to help
ru_ru: Ее цель состоит в том, чтобы помочь:

source: Its width (height) is set according to the |size| and |overlap| options of the |layout| command to
ru_ru: Его ширина (высота) устанавливается в соответствии с опциями |size| и |overlap| команды |layout|.

source: JTSK is not supported on output (iJTSK is).
ru_ru: JTSK не поддерживается на выходе (как и iJTSK).

source: Join works in two modes: it joins either two scraps or two or more points or lines in a map together.
ru_ru: Соединение работает в двух режимах: оно объединяет либо два скрапа, либо две или несколько точек или линий на карте вместе.

source: Joining arrows are created from { map-connection} points specified in scraps that are moved.
ru_ru: Соединительные стрелки создаются из точек { map-connection}, указанных в смещающихся скрапах.

source: Jul 27: Therion 0.2 --- Therion compiles simple map (consisting of two scraps) for the first time (800 kB of source code)
ru_ru: Июль, 27: Therion 0.2 -- Therion впервые компилирует простую карту (состоящую из двух скрапов) (800 КБ исходного кода).

source: Jun: all Perl scripts rewritten in C++, Therion is one executable program now (although using Survex and )
ru_ru: Июнь: все сценарии Perl переписанные на C++, Therion -- это одна\break исполняемая программа (хотя использует Survex и ).

source: Just add |explored <explored-length>| to the station flags.
ru_ru: Просто добавьте флаг |explored <исследовательская длинна>| для станции.

source: Just use following syntax
ru_ru: Используйте следующий синтаксис

source: Keyboard and mouse shortcuts in the Map editor.
ru_ru: Сочетания клавиш и мыши в редакторе карт.

source: Labyrinth.
ru_ru: Лабиринт.

source: Last possibility is to import your .3d file using
ru_ru: Последняя возможность -- импортировать файл .3d, используя

source: Layout command makes it possible to modify some macros in the configuration file at the run-time.
ru_ru: Команда |layout| позволяет изменять некоторые макросы в файле конфигурации во время выполнения.

source: Let's begin by describing typical use of the map editor.
ru_ru: Начнем с описания типичного использования редактора карт.

source: Limitations.
ru_ru: Ограничения.

source: Line is a command for drawing a line symbol on the map.
ru_ru: Line -- это команда для рисования символа линии на карте.

source: Line symbols differ from point symbols in respect that there is no local coordinate system.
ru_ru: Линейные символы отличаются от точечных символов тем, что нет\break локальной системы координат.

source: Line symbols.
ru_ru: Линейные символы.

source: Linux is a default.
ru_ru: Linux по умолчанию;

source: Lists---caves, surveys, continuations.
ru_ru: Списки -- пещеры, съемки, продолжения (перспективы).

source: Loch is a 3D model viewer included in the Therion distribution.
ru_ru: Loch -- просмотрщик 3D-моделей, включенный в дистрибутив Therion'а.

source: Log file.
ru_ru: Файл журнала.

source: Loop closure algorithm included into Therion.
ru_ru: Алгоритм замыкания колец включен в Therion.

source: Lower-left corner of the map is |0 0|, upper-right corner is |100 100|.
ru_ru: Нижний левый угол карты равен |0 0|, верхний правый угол |100 100|.\break

source: Macro || should be used without redefinition in the place where you want to display the content of its argument; for custom data formatting redefine || macro.
ru_ru: Макрос || следует использовать без переопределения в том месте, где вы хотите отобразить содержимое своего аргумента; для\break форматирования пользовательских данных переопределите макрос\break ||.

source: Magnetic declination.
ru_ru: Магнитное склонение.

source: Majority of point symbol definitions has four arguments: position (pair), rotation (numeric), scale (numeric) and alignment (pair).
ru_ru: Большинство определений точечных символов имеют четыре аргумента: position (положение, пара), rotation (вращение, числовое), scale (масштаб, числовое) и alignment (выравнивание, пара).

source: Map editor allows you to draw and edit map fully interactively.
ru_ru: Редактор карт позволяет вам рисовать и редактировать карту полностью в интерактивном режиме.

source: Map in Survex format is intended for a quick preview in Aven.
ru_ru: Карта в формате Survex предназначена для быстрого просмотра в Aven.

source: Map in XVI format contains centreline with LRUD (and optionally morphed sketches) and can be imported in XTherion to serve as a background for digitization.
ru_ru: Карта в формате XVI содержит нитку хода с LRUD (и, возможно, эскизом подвергнувшимся морфингу) и может быть импортирована в XTherion,\break чтобы служить фоном для оцифровки.

source: Map object simplifies the data management when selecting data for output.
ru_ru: Объект карты упрощает управление данными при выборе данных для вывода.

source: Map pages are inserted at its position.
ru_ru: Страницы карты вставляются в его положение.

source: Map with station names in this case looks like this:
ru_ru: Карта с названиями станций в этом случае выглядит так:

source: Maps are produced in PDF and SVG formats, which may be viewed or printed in a wide variety of viewers.
ru_ru: Карты создаются в форматах PDF и SVG, которые могут быть просмотрены или распечатаны в большом количестве программ.

source: Maps for GIS.
ru_ru: Карты для GIS.

source: Maps for printing.
ru_ru: Карты для печати.

source: Maps produced in DXF, ESRI or KML formats may be further processed in appropriate software.
ru_ru: Карты, созданные в форматах DXF, ESRI или KML, могут быть\break дополнительно обработаны в соответствующем программном обеспечении.

source: Mar: Therion 0.1 --- Therion is able to process survey data (centreline) of the Cave of Dead Bats.
ru_ru: Март: Therion 0.1 -- Therion способен обрабатывать данные съемки\break (центральной линии) пещеры Мертвых летучих мышей.

source: Mar: Therion 0.3 --- Therion exports 3D model created from 2D maps.
ru_ru: Март: Therion 0.3 -- Therion экспортирует трехмерную модель, созданную с 2D-карт.

source: Mar: the first version of The Therion Book finished
ru_ru: Март: первая версия Therion Book завершена.

source: May be combined with |symbol-hide|.
ru_ru: Может комбинироваться с |symbol-hide|.

source: May be combined with |symbol-show|.(M, A) * |symbol-show <point/line/area/group/special> <symbol-type>| = display particular symbol or group of symbols.
ru_ru: Может комбинироваться с |symbol-show|. (M, A). * |symbol-show <point/line/area/group/special> <тип символа>| = отображать определенный символ или группу символов.

source: May be either a number or a character.
ru_ru: Может быть либо числом, либо символом.

source: Meaning of colors:
ru_ru: Значения цветов:

source: Metres by default.
ru_ru: Метры по умолчанию.

source: More advanced is the default definition of the || macro:
ru_ru: Более продвинутым является определение по умолчанию макроса ||:

source: Morphed sketch after { extra} points insertion:
ru_ru: Эскиз подвергшийся морфингу после вставки точек { extra}:

source: Move them by double clicking and dragging with the right mouse button or through a menu.
ru_ru: Переместить их можно двойным щелчком правой кнопкой мыши на изображении и перетаскиванием или через меню.

source: Multiple files are written to a directory with the specified filename.], |kml| (Google Earth), |xvi|Xtherion vector image.
ru_ru: Несколько файлов записываются в каталог с указанным именем файла.], |kml| (Google Earth), |xvi|Векторное изображение Xtherion'а.

source: N.B.: The declination is positive when the magnetic north is east of true north.
ru_ru: Обратите внимание: склонение положительно, когда магнитный север\break находится к востоку от истинного севера.

source: Named sizes scale by $ 2$, so that $xs 0.5$, $s 0.707$, $m 1.0$, $l 1.414$ and $xl 2.0$.
ru_ru: Именованные масштабы кратны $ 2$, и имеют следующие значения: $xs 0.5$, $s 0.707$, $m 1.0$, $l 1.414$ и $xl 2.0$.

source: Necessary only if you want to create 2D maps in PDF or SVG format.
ru_ru: Необходимо только в том случае, если вы хотите\break создавать 2D-карты в формате PDF или SVG.

source: New map symbols.
ru_ru: Новые символы карты.

source: New symbols may be defined in the |code metapost| section of the |layout| command.
ru_ru: Новые символы могут быть определены в разделе |code metapost| команды\break |layout|.

source: Newly created point, line and text objects are added before the currently marked line in the outline.
ru_ru: Вновь созданные точечные, линейные и текстовые\break объекты добавляются перед текущей выделенной строкой.

source: Next it transforms all other data (e.g. 2D maps) according to new stations position.
ru_ru: Затем он преобразует все другие данные (например 2D-карты) в\break соответствии с позицией новых станций.

source: No index is allowed for this projection.
ru_ru: Для этой проекции не указывается индекс.

source: No section curve is displayed.{xsect.1}], |survey|Survey line is automatically drawn by Therion.], |map-connection|Used to indicate connection between maps (in offset, or the same points in extended elevation).], |u|For user defined line symbols.].
ru_ru: Кривая сечения не отображается.{xsect.1}], |survey| (нитка хода)Нитка хода автоматически рисуется Therion'ом.], |map-connection| (линия выноса)Используется для указания соединения между картами (при смещении или же точками в разрез-развертке).], |u|Для определенных пользователем линейных символов.].

source: None is default.
ru_ru: По умолчанию `none'.

source: Normal is default.
ru_ru: По умолчанию\break normal.

source: Normally therion writes all the messages into a therion.log file in the current directory.
ru_ru: Обычно Therion записывает все\break сообщения в файл therion.log в текущем каталоге.

source: North arrow and scale bar may be displayed using
ru_ru: Стрелка направления на север и шкала масштаба могут отображаться с использованием:

source: Note that no surveys are created in this case.
ru_ru: Обратите внимание, что в этом случае не создаются съемки.

source: Note that you can not mix them together.
ru_ru: Обратите внимание, что вы не можете указывать их вместе.

source: Note the || macro.
ru_ru: Обратите внимание на макрос ||.

source: Note, that Windows installation does not include |ghostscript|] to a raster format.
ru_ru: Обратите внимание, что установщик Windows не содержит |ghostscript|.] в растровый формат.

source: Nov: start of programming (Perl scripts and macros)
ru_ru: Ноябрь: начало программирования (скрипты Perl и макросы ).

source: Nov: start of reimplementation from scratch: Therion (C++ with some Perl scripts inherited from the previous version); notion of a scrap; interactive 2D map editor ThEdit as a replacement of xthedit (Delphi)
ru_ru: Ноябрь: начало повторной реализации с нуля: Therion (C++ с некоторыми скриптами Perl, унаследованными от предыдущей версии); понятие\break скрапа; интерактивный редактор 2D-карт ThEdit в качестве замены\break xthedit (Delphi).

source: Now it looks better,
ru_ru: Теперь это выглядит лучше,
